export const STEMS = ["甲","乙","丙","丁","戊","己","庚","辛","壬","癸"];
export const BRANCHES = ["子","丑","寅","卯","辰","巳","午","未","申","酉","戌","亥"];

export const STEM_EL = {
  甲: "木",
  乙: "木",
  丙: "火",
  丁: "火",
  戊: "土",
  己: "土",
  庚: "金",
  辛: "金",
  壬: "水",
  癸: "水",
};

export const BR_EL = {
  子: "水",
  丑: "土",
  寅: "木",
  卯: "木",
  辰: "土",
  巳: "火",
  午: "火",
  未: "土",
  申: "金",
  酉: "金",
  戌: "土",
  亥: "水",
};

export const STEM_YY = {
  甲: "阳",
  乙: "阴",
  丙: "阳",
  丁: "阴",
  戊: "阳",
  己: "阴",
  庚: "阳",
  辛: "阴",
  壬: "阳",
  癸: "阴",
};

export const ZODIAC_M = {
  子: "鼠",
  丑: "牛",
  寅: "虎",
  卯: "兔",
  辰: "龙",
  巳: "蛇",
  午: "马",
  未: "羊",
  申: "猴",
  酉: "鸡",
  戌: "狗",
  亥: "猪",
};

export const EN = {
  木: "Wood",
  火: "Fire",
  土: "Earth",
  金: "Metal",
  水: "Water",
};

export const HIDDEN = {
  子: ["癸"],
  丑: ["己", "癸", "辛"],
  寅: ["甲", "丙", "戊"],
  卯: ["乙"],
  辰: ["戊", "乙", "癸"],
  巳: ["丙", "庚", "戊"],
  午: ["丁", "己"],
  未: ["己", "丁", "乙"],
  申: ["庚", "壬", "戊"],
  酉: ["辛"],
  戌: ["戊", "辛", "丁"],
  亥: ["壬", "甲"],
};

export const NAYIN_T = [
  "海中金","炉中火","大林木","路旁土","剑锋金","山头火",
  "涧下水","城头土","白蜡金","杨柳木","泉中水","屋上土",
  "霹雳火","松柏木","长流水","砂中金","山下火","平地木",
  "壁上土","金箔金","覆灯火","天河水","大驿土","钗钏金",
  "桑柘木","大溪水","砂中土","天上火","石榴木","大海水"
];

export const GEN_BY = { 木: "水", 火: "木", 土: "火", 金: "土", 水: "金" };
export const CTRL_BY = { 木: "金", 火: "水", 土: "木", 金: "火", 水: "土" };
export const GENERATES = { 木: "火", 火: "土", 土: "金", 金: "水", 水: "木" };
export const CONTROLS = { 木: "土", 火: "金", 土: "水", 金: "木", 水: "火" };

